turbq/atprog/packs/atmel/SAM4C_DFP/1.0.86/sam4cm/atdf/ATSAM4CMS4C_1.atdf
      <value-group caption="" name="SUPC_SMMR__SMSMPL">
        <value caption="Supply Monitor disabled" name="SMD" value="0x0"/>
        <value caption="Continuous Supply Monitor" name="CSM" value="0x1"/>
        <value caption="Supply Monitor enabled one SLCK period every 32 SLCK periods" name="_32SLCK" value="0x2"/>
        <value caption="Supply Monitor enabled one SLCK period every 256 SLCK periods" name="_256SLCK" value="0x3"/>
        <value caption="Supply Monitor enabled one SLCK period every 2,048 SLCK periods" name="_2048SLCK" value="0x4"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMRSTEN">
        <value caption="The system reset signal is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The system reset signal is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_SMMR__SMIEN">
        <value caption="The SUPC interrupt signal is not affected when a supply monitor detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The SUPC interrupt signal is asserted when a supply monitor detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__LCDMODE">
        <value caption="The internal supply source and the external supply source are both deselected (OFF mode)." name="LCDOFF" value="0x0"/>
        <value caption="The external supply source for LCD (VDDLCD) is selected (the LCD voltage regulator is in Hi-Z mode)." name="LCDON_EXTVR" value="0x2"/>
        <value caption="The internal supply source for LCD (the LCD Voltage Regulator) is selected (Active mode)." name="LCDON_INVR" value="0x3"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODRSTEN">
        <value caption="The system reset signal is not affected when a brownout detection occurs." name="NOT_ENABLE" value="0"/>
        <value caption="The system reset signal is asserted when a brownout detection occurs." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BODDIS">
        <value caption="The core brownout detector is enabled." name="ENABLE" value="0"/>
        <value caption="The core brownout detector is disabled." name="DISABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__ONREG">
        <value caption="Internal voltage regulator is not used (external power supply is used)." name="ONREG_UNUSED" value="0"/>
        <value caption="Internal voltage regulator is used." name="ONREG_USED" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__BUPPOREN">
        <value caption="Disables the backup POR." name="BUPPOR_DISABLE" value="0"/>
        <value caption="Enables the backup POR." name="BUPPOR_ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__OSCBYPASS">
        <value caption="No effect. Clock selection depends on XTALSEL value." name="NO_EFFECT" value="0"/>
        <value caption="The 32 kHz crystal oscillator is bypassed if XTALSEL = 1. OSCBYPASS must be set before setting XTALSEL." name="BYPASS" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_MR__KEY">
        <value caption="Writing any other value in this field aborts the write operation." name="PASSWD" value="0xA5"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__FWUPEN">
        <value caption="The force wake-up pin has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="The force wake-up pin low forces a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__SMEN">
        <value caption="The supply monitor detection has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="The supply monitor detection forces a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__RTTEN">
        <value caption="The RTT alarm signal has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="The RTT alarm signal forces a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__RTCEN">
        <value caption="The RTC alarm signal has no wake-up effect." name="NOT_ENABLE" value="0"/>
        <value caption="The RTC alarm signal forces a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCEN0">
        <value caption="The WKUP0/TMP0 input pin is not connected to the low-power debouncer." name="NOT_ENABLE" value="0"/>
        <value caption="The WKUP0/TMP0 input pin is connected to the low-power debouncer and can force a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCEN1">
        <value caption="The WKUP10/TMP1 input pin is not connected to the low-power debouncer." name="NOT_ENABLE" value="0"/>
        <value caption="The WKUP10/TMP1 input pin is connected to the low-power debouncer and can force a system wake-up." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__LPDBCCLR">
        <value caption="A low-power debounce event does not create an immediate clear on the first half of GPBR registers." name="NOT_ENABLE" value="0"/>
        <value caption="A low-power debounce event on WKUP0/TMP0 or WKUP10TMP1(if DISTMPCLR1 is cleared) generates an immediate clear on the first half of GPBR registers." name="ENABLE" value="1"/>
      </value-group>
      <value-group caption="" name="SUPC_WUMR__FWUPDBC">
        <value caption="Immediate, no debouncing, detected active at least on one Slow Clock edge." name="IMMEDIATE" value="0x0"/>
        <value caption="FWUP shall be low for at least 3 SLCK periods" name="_3_SCLK" value="0x1"/>
        <value caption="FWUP shall be low for at least 32 SLCK periods" name="_32_SCLK" value="0x2"/>
        <value caption="FWUP shall be low for at least 512 SLCK periods" name="_512_SCLK" value="0x3"/>
        <value caption="FWUP shall be low for at least 4,096 SLCK periods" name="_4096_SCLK" value="0x4"/>
        <value caption="FWUP shall be low for at least 32,768 SLCK periods" name="_32768_SCLK" value="0x5"/>
      </value-group>
